loadtests/results/spike-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 1500 max VUs, 3m20s max duration (incl. graceful stop):
              * spike: Up to 600.00 iterations/s for 2m50s over 5 stages (maxVUs: 200-1500, gracefulStop: 30s)


running (0m01.0s), 0000/0200 VUs, 19 complete and 0 interrupted iterations
spike   [   1% ] 0000/0200 VUs  0m01.0s/2m50s  020.00 iters/s

running (0m02.0s), 0000/0200 VUs, 39 complete and 0 interrupted iterations
spike   [   1% ] 0000/0200 VUs  0m02.0s/2m50s  020.00 iters/s

running (0m03.0s), 0000/0200 VUs, 59 complete and 0 interrupted iterations
spike   [   2% ] 0000/0200 VUs  0m03.0s/2m50s  020.00 iters/s

running (0m04.0s), 0000/0200 VUs, 79 complete and 0 interrupted iterations
spike   [   2% ] 0000/0200 VUs  0m04.0s/2m50s  020.00 iters/s

running (0m05.0s), 0000/0200 VUs, 99 complete and 0 interrupted iterations
spike   [   3% ] 0000/0200 VUs  0m05.0s/2m50s  020.00 iters/s

running (0m06.0s), 0000/0200 VUs, 119 complete and 0 interrupted iterations
spike   [   4% ] 0000/0200 VUs  0m06.0s/2m50s  020.00 iters/s

running (0m07.0s), 0000/0200 VUs, 139 complete and 0 interrupted iterations
spike   [   4% ] 0000/0200 VUs  0m07.0s/2m50s  020.00 iters/s

running (0m08.0s), 0000/0200 VUs, 159 complete and 0 interrupted iterations
spike   [   5% ] 0000/0200 VUs  0m08.0s/2m50s  020.00 iters/s

running (0m09.0s), 0000/0200 VUs, 179 complete and 0 interrupted iterations
spike   [   5% ] 0000/0200 VUs  0m09.0s/2m50s  020.00 iters/s

running (0m10.0s), 0000/0200 VUs, 199 complete and 0 interrupted iterations
spike   [   6% ] 0000/0200 VUs  0m10.0s/2m50s  020.00 iters/s

running (0m11.0s), 0000/0200 VUs, 219 complete and 0 interrupted iterations
spike   [   6% ] 0000/0200 VUs  0m11.0s/2m50s  020.00 iters/s

running (0m12.0s), 0000/0200 VUs, 239 complete and 0 interrupted iterations
spike   [   7% ] 0000/0200 VUs  0m12.0s/2m50s  020.00 iters/s

running (0m13.0s), 0000/0200 VUs, 259 complete and 0 interrupted iterations
spike   [   8% ] 0000/0200 VUs  0m13.0s/2m50s  020.00 iters/s

running (0m14.0s), 0000/0200 VUs, 279 complete and 0 interrupted iterations
spike   [   8% ] 0000/0200 VUs  0m14.0s/2m50s  020.00 iters/s

running (0m15.0s), 0000/0200 VUs, 299 complete and 0 interrupted iterations
spike   [   9% ] 0000/0200 VUs  0m15.0s/2m50s  020.00 iters/s

running (0m16.0s), 0000/0200 VUs, 319 complete and 0 interrupted iterations
spike   [   9% ] 0000/0200 VUs  0m16.0s/2m50s  020.00 iters/s

running (0m17.0s), 0000/0200 VUs, 339 complete and 0 interrupted iterations
spike   [  10% ] 0000/0200 VUs  0m17.0s/2m50s  020.00 iters/s

running (0m18.0s), 0000/0200 VUs, 359 complete and 0 interrupted iterations
spike   [  11% ] 0000/0200 VUs  0m18.0s/2m50s  020.00 iters/s

running (0m19.0s), 0000/0200 VUs, 379 complete and 0 interrupted iterations
spike   [  11% ] 0000/0200 VUs  0m19.0s/2m50s  020.00 iters/s

running (0m20.0s), 0000/0200 VUs, 399 complete and 0 interrupted iterations
spike   [  12% ] 0000/0200 VUs  0m20.0s/2m50s  020.00 iters/s

running (0m21.0s), 0000/0200 VUs, 419 complete and 0 interrupted iterations
spike   [  12% ] 0000/0200 VUs  0m21.0s/2m50s  020.00 iters/s

running (0m22.0s), 0000/0200 VUs, 439 complete and 0 interrupted iterations
spike   [  13% ] 0000/0200 VUs  0m22.0s/2m50s  020.00 iters/s

running (0m23.0s), 0000/0200 VUs, 459 complete and 0 interrupted iterations
spike   [  14% ] 0000/0200 VUs  0m23.0s/2m50s  020.00 iters/s

running (0m24.0s), 0000/0200 VUs, 479 complete and 0 interrupted iterations
spike   [  14% ] 0000/0200 VUs  0m24.0s/2m50s  020.00 iters/s

running (0m25.0s), 0000/0200 VUs, 499 complete and 0 interrupted iterations
spike   [  15% ] 0000/0200 VUs  0m25.0s/2m50s  020.00 iters/s

running (0m26.0s), 0000/0200 VUs, 519 complete and 0 interrupted iterations
spike   [  15% ] 0000/0200 VUs  0m26.0s/2m50s  020.00 iters/s

running (0m27.0s), 0000/0200 VUs, 539 complete and 0 interrupted iterations
spike   [  16% ] 0000/0200 VUs  0m27.0s/2m50s  020.00 iters/s

running (0m28.0s), 0000/0200 VUs, 559 complete and 0 interrupted iterations
spike   [  16% ] 0000/0200 VUs  0m28.0s/2m50s  020.00 iters/s

running (0m29.0s), 0000/0200 VUs, 579 complete and 0 interrupted iterations
spike   [  17% ] 0000/0200 VUs  0m29.0s/2m50s  020.00 iters/s

running (0m30.0s), 0000/0200 VUs, 599 complete and 0 interrupted iterations
spike   [  18% ] 0000/0200 VUs  0m30.0s/2m50s  020.00 iters/s

running (0m31.0s), 0000/0200 VUs, 647 complete and 0 interrupted iterations
spike   [  18% ] 0000/0200 VUs  0m31.0s/2m50s  076.88 iters/s

running (0m32.0s), 0000/0200 VUs, 753 complete and 0 interrupted iterations
spike   [  19% ] 0000/0200 VUs  0m32.0s/2m50s  134.93 iters/s

running (0m33.0s), 0000/0200 VUs, 917 complete and 0 interrupted iterations
spike   [  19% ] 0000/0200 VUs  0m33.0s/2m50s  192.95 iters/s

running (0m34.0s), 0000/0200 VUs, 1139 complete and 0 interrupted iterations
spike   [  20% ] 0000/0200 VUs  0m34.0s/2m50s  250.96 iters/s

running (0m35.0s), 0001/0200 VUs, 1418 complete and 0 interrupted iterations
spike   [  21% ] 0001/0200 VUs  0m35.0s/2m50s  308.97 iters/s

running (0m36.0s), 0001/0200 VUs, 1756 complete and 0 interrupted iterations
spike   [  21% ] 0001/0200 VUs  0m36.0s/2m50s  366.97 iters/s

running (0m37.0s), 0001/0200 VUs, 2152 complete and 0 interrupted iterations
spike   [  22% ] 0001/0200 VUs  0m37.0s/2m50s  424.98 iters/s

running (0m38.0s), 0001/0200 VUs, 2606 complete and 0 interrupted iterations
spike   [  22% ] 0001/0200 VUs  0m38.0s/2m50s  482.98 iters/s

running (0m39.0s), 0001/0200 VUs, 3118 complete and 0 interrupted iterations
spike   [  23% ] 0001/0200 VUs  0m39.0s/2m50s  540.98 iters/s

running (0m40.0s), 0000/0200 VUs, 3688 complete and 0 interrupted iterations
spike   [  24% ] 0000/0200 VUs  0m40.0s/2m50s  598.89 iters/s

running (0m41.0s), 0002/0200 VUs, 4287 complete and 0 interrupted iterations
spike   [  24% ] 0002/0200 VUs  0m41.0s/2m50s  600.00 iters/s

running (0m42.0s), 0001/0200 VUs, 4888 complete and 0 interrupted iterations
spike   [  25% ] 0001/0200 VUs  0m42.0s/2m50s  600.00 iters/s

running (0m43.0s), 0001/0200 VUs, 5488 complete and 0 interrupted iterations
spike   [  25% ] 0001/0200 VUs  0m43.0s/2m50s  600.00 iters/s

running (0m44.0s), 0001/0200 VUs, 6088 complete and 0 interrupted iterations
spike   [  26% ] 0001/0200 VUs  0m44.0s/2m50s  600.00 iters/s

running (0m45.0s), 0001/0200 VUs, 6688 complete and 0 interrupted iterations
spike   [  26% ] 0001/0200 VUs  0m45.0s/2m50s  600.00 iters/s

running (0m46.0s), 0001/0200 VUs, 7288 complete and 0 interrupted iterations
spike   [  27% ] 0001/0200 VUs  0m46.0s/2m50s  600.00 iters/s

running (0m47.0s), 0001/0200 VUs, 7888 complete and 0 interrupted iterations
spike   [  28% ] 0001/0200 VUs  0m47.0s/2m50s  600.00 iters/s

running (0m48.0s), 0000/0200 VUs, 8488 complete and 0 interrupted iterations
spike   [  28% ] 0000/0200 VUs  0m48.0s/2m50s  600.00 iters/s

running (0m49.0s), 0001/0200 VUs, 9088 complete and 0 interrupted iterations
spike   [  29% ] 0001/0200 VUs  0m49.0s/2m50s  600.00 iters/s

running (0m50.0s), 0001/0200 VUs, 9688 complete and 0 interrupted iterations
spike   [  29% ] 0001/0200 VUs  0m50.0s/2m50s  600.00 iters/s

running (0m51.0s), 0001/0200 VUs, 10288 complete and 0 interrupted iterations
spike   [  30% ] 0001/0200 VUs  0m51.0s/2m50s  600.00 iters/s

running (0m52.0s), 0001/0200 VUs, 10888 complete and 0 interrupted iterations
spike   [  31% ] 0001/0200 VUs  0m52.0s/2m50s  600.00 iters/s

running (0m53.0s), 0001/0200 VUs, 11488 complete and 0 interrupted iterations
spike   [  31% ] 0001/0200 VUs  0m53.0s/2m50s  600.00 iters/s

running (0m54.0s), 0001/0200 VUs, 12088 complete and 0 interrupted iterations
spike   [  32% ] 0001/0200 VUs  0m54.0s/2m50s  600.00 iters/s

running (0m55.0s), 0001/0200 VUs, 12688 complete and 0 interrupted iterations
spike   [  32% ] 0001/0200 VUs  0m55.0s/2m50s  600.00 iters/s

running (0m56.0s), 0000/0200 VUs, 13288 complete and 0 interrupted iterations
spike   [  33% ] 0000/0200 VUs  0m56.0s/2m50s  600.00 iters/s

running (0m57.0s), 0001/0200 VUs, 13888 complete and 0 interrupted iterations
spike   [  34% ] 0001/0200 VUs  0m57.0s/2m50s  600.00 iters/s

running (0m58.0s), 0001/0200 VUs, 14488 complete and 0 interrupted iterations
spike   [  34% ] 0001/0200 VUs  0m58.0s/2m50s  600.00 iters/s

running (0m59.0s), 0001/0200 VUs, 15088 complete and 0 interrupted iterations
spike   [  35% ] 0001/0200 VUs  0m59.0s/2m50s  600.00 iters/s

running (1m00.0s), 0001/0200 VUs, 15688 complete and 0 interrupted iterations
spike   [  35% ] 0001/0200 VUs  1m00.0s/2m50s  600.00 iters/s

running (1m01.0s), 0000/0200 VUs, 16288 complete and 0 interrupted iterations
spike   [  36% ] 0000/0200 VUs  1m01.0s/2m50s  600.00 iters/s

running (1m02.0s), 0001/0200 VUs, 16887 complete and 0 interrupted iterations
spike   [  36% ] 0001/0200 VUs  1m02.0s/2m50s  600.00 iters/s

running (1m03.0s), 0000/0200 VUs, 17488 complete and 0 interrupted iterations
spike   [  37% ] 0000/0200 VUs  1m03.0s/2m50s  600.00 iters/s

running (1m04.0s), 0000/0200 VUs, 18088 complete and 0 interrupted iterations
spike   [  38% ] 0000/0200 VUs  1m04.0s/2m50s  600.00 iters/s

running (1m05.0s), 0000/0200 VUs, 18688 complete and 0 interrupted iterations
spike   [  38% ] 0000/0200 VUs  1m05.0s/2m50s  600.00 iters/s

running (1m06.0s), 0000/0200 VUs, 19288 complete and 0 interrupted iterations
spike   [  39% ] 0000/0200 VUs  1m06.0s/2m50s  600.00 iters/s

running (1m07.0s), 0000/0200 VUs, 19888 complete and 0 interrupted iterations
spike   [  39% ] 0000/0200 VUs  1m07.0s/2m50s  600.00 iters/s

running (1m08.0s), 0000/0200 VUs, 20488 complete and 0 interrupted iterations
spike   [  40% ] 0000/0200 VUs  1m08.0s/2m50s  600.00 iters/s

running (1m09.0s), 0001/0200 VUs, 21088 complete and 0 interrupted iterations
spike   [  41% ] 0001/0200 VUs  1m09.0s/2m50s  600.00 iters/s

running (1m10.0s), 0001/0200 VUs, 21687 complete and 0 interrupted iterations
spike   [  41% ] 0001/0200 VUs  1m10.0s/2m50s  600.00 iters/s

running (1m11.0s), 0001/0200 VUs, 22288 complete and 0 interrupted iterations
spike   [  42% ] 0001/0200 VUs  1m11.0s/2m50s  600.00 iters/s

running (1m12.0s), 0001/0200 VUs, 22888 complete and 0 interrupted iterations
spike   [  42% ] 0001/0200 VUs  1m12.0s/2m50s  600.00 iters/s

running (1m13.0s), 0001/0200 VUs, 23488 complete and 0 interrupted iterations
spike   [  43% ] 0001/0200 VUs  1m13.0s/2m50s  600.00 iters/s

running (1m14.0s), 0001/0200 VUs, 24088 complete and 0 interrupted iterations
spike   [  44% ] 0001/0200 VUs  1m14.0s/2m50s  600.00 iters/s

running (1m15.0s), 0001/0200 VUs, 24688 complete and 0 interrupted iterations
spike   [  44% ] 0001/0200 VUs  1m15.0s/2m50s  600.00 iters/s

running (1m16.0s), 0000/0200 VUs, 25288 complete and 0 interrupted iterations
spike   [  45% ] 0000/0200 VUs  1m16.0s/2m50s  600.00 iters/s

running (1m17.0s), 0001/0200 VUs, 25888 complete and 0 interrupted iterations
spike   [  45% ] 0001/0200 VUs  1m17.0s/2m50s  600.00 iters/s

running (1m18.0s), 0001/0200 VUs, 26488 complete and 0 interrupted iterations
spike   [  46% ] 0001/0200 VUs  1m18.0s/2m50s  600.00 iters/s

running (1m19.0s), 0001/0200 VUs, 27088 complete and 0 interrupted iterations
spike   [  46% ] 0001/0200 VUs  1m19.0s/2m50s  600.00 iters/s

running (1m20.0s), 0000/0200 VUs, 27688 complete and 0 interrupted iterations
spike   [  47% ] 0000/0200 VUs  1m20.0s/2m50s  600.00 iters/s

running (1m21.0s), 0001/0200 VUs, 28288 complete and 0 interrupted iterations
spike   [  48% ] 0001/0200 VUs  1m21.0s/2m50s  600.00 iters/s

running (1m22.0s), 0001/0200 VUs, 28887 complete and 0 interrupted iterations
spike   [  48% ] 0001/0200 VUs  1m22.0s/2m50s  600.00 iters/s

running (1m23.0s), 0001/0200 VUs, 29488 complete and 0 interrupted iterations
spike   [  49% ] 0001/0200 VUs  1m23.0s/2m50s  600.00 iters/s

running (1m24.0s), 0001/0200 VUs, 30088 complete and 0 interrupted iterations
spike   [  49% ] 0001/0200 VUs  1m24.0s/2m50s  600.00 iters/s

running (1m25.0s), 0000/0200 VUs, 30688 complete and 0 interrupted iterations
spike   [  50% ] 0000/0200 VUs  1m25.0s/2m50s  600.00 iters/s

running (1m26.0s), 0001/0200 VUs, 31288 complete and 0 interrupted iterations
spike   [  51% ] 0001/0200 VUs  1m26.0s/2m50s  600.00 iters/s

running (1m27.0s), 0001/0200 VUs, 31888 complete and 0 interrupted iterations
spike   [  51% ] 0001/0200 VUs  1m27.0s/2m50s  600.00 iters/s

running (1m28.0s), 0001/0200 VUs, 32487 complete and 0 interrupted iterations
spike   [  52% ] 0001/0200 VUs  1m28.0s/2m50s  600.00 iters/s

running (1m29.0s), 0001/0200 VUs, 33088 complete and 0 interrupted iterations
spike   [  52% ] 0001/0200 VUs  1m29.0s/2m50s  600.00 iters/s

running (1m30.0s), 0001/0200 VUs, 33688 complete and 0 interrupted iterations
spike   [  53% ] 0001/0200 VUs  1m30.0s/2m50s  600.00 iters/s

running (1m31.0s), 0001/0200 VUs, 34288 complete and 0 interrupted iterations
spike   [  54% ] 0001/0200 VUs  1m31.0s/2m50s  600.00 iters/s

running (1m32.0s), 0000/0200 VUs, 34888 complete and 0 interrupted iterations
spike   [  54% ] 0000/0200 VUs  1m32.0s/2m50s  600.00 iters/s

running (1m33.0s), 0001/0200 VUs, 35488 complete and 0 interrupted iterations
spike   [  55% ] 0001/0200 VUs  1m33.0s/2m50s  600.00 iters/s

running (1m34.0s), 0000/0200 VUs, 36088 complete and 0 interrupted iterations
spike   [  55% ] 0000/0200 VUs  1m34.0s/2m50s  600.00 iters/s

running (1m35.0s), 0001/0200 VUs, 36687 complete and 0 interrupted iterations
spike   [  56% ] 0001/0200 VUs  1m35.0s/2m50s  600.00 iters/s

running (1m36.0s), 0001/0200 VUs, 37287 complete and 0 interrupted iterations
spike   [  56% ] 0000/0200 VUs  1m36.0s/2m50s  600.00 iters/s

running (1m37.0s), 0001/0200 VUs, 37887 complete and 0 interrupted iterations
spike   [  57% ] 0001/0200 VUs  1m37.0s/2m50s  600.00 iters/s

running (1m38.0s), 0001/0200 VUs, 38488 complete and 0 interrupted iterations
spike   [  58% ] 0001/0200 VUs  1m38.0s/2m50s  600.00 iters/s

running (1m39.0s), 0001/0200 VUs, 39088 complete and 0 interrupted iterations
spike   [  58% ] 0001/0200 VUs  1m39.0s/2m50s  600.00 iters/s

running (1m40.0s), 0000/0200 VUs, 39688 complete and 0 interrupted iterations
spike   [  59% ] 0000/0200 VUs  1m40.0s/2m50s  600.00 iters/s

running (1m41.0s), 0000/0200 VUs, 40260 complete and 0 interrupted iterations
spike   [  59% ] 0000/0200 VUs  1m41.0s/2m50s  543.02 iters/s

running (1m42.0s), 0000/0200 VUs, 40774 complete and 0 interrupted iterations
spike   [  60% ] 0000/0200 VUs  1m42.0s/2m50s  485.14 iters/s

running (1m43.0s), 0001/0200 VUs, 41230 complete and 0 interrupted iterations
spike   [  61% ] 0001/0200 VUs  1m43.0s/2m50s  427.02 iters/s

running (1m44.0s), 0001/0200 VUs, 41628 complete and 0 interrupted iterations
spike   [  61% ] 0001/0200 VUs  1m44.0s/2m50s  369.02 iters/s

running (1m45.0s), 0001/0200 VUs, 41968 complete and 0 interrupted iterations
spike   [  62% ] 0001/0200 VUs  1m45.0s/2m50s  311.03 iters/s

running (1m46.0s), 0000/0200 VUs, 42251 complete and 0 interrupted iterations
spike   [  62% ] 0000/0200 VUs  1m46.0s/2m50s  253.03 iters/s

running (1m47.0s), 0000/0200 VUs, 42475 complete and 0 interrupted iterations
spike   [  63% ] 0000/0200 VUs  1m47.0s/2m50s  195.04 iters/s

running (1m48.0s), 0000/0200 VUs, 42641 complete and 0 interrupted iterations
spike   [  64% ] 0000/0200 VUs  1m48.0s/2m50s  137.06 iters/s

running (1m49.0s), 0000/0200 VUs, 42749 complete and 0 interrupted iterations
spike   [  64% ] 0000/0200 VUs  1m49.0s/2m50s  079.11 iters/s

running (1m50.0s), 0000/0200 VUs, 42799 complete and 0 interrupted iterations
spike   [  65% ] 0000/0200 VUs  1m50.0s/2m50s  021.36 iters/s

running (1m51.0s), 0000/0200 VUs, 42819 complete and 0 interrupted iterations
spike   [  65% ] 0000/0200 VUs  1m51.0s/2m50s  020.00 iters/s

running (1m52.0s), 0000/0200 VUs, 42839 complete and 0 interrupted iterations
spike   [  66% ] 0000/0200 VUs  1m52.0s/2m50s  020.00 iters/s

running (1m53.0s), 0000/0200 VUs, 42859 complete and 0 interrupted iterations
spike   [  66% ] 0000/0200 VUs  1m53.0s/2m50s  020.00 iters/s

running (1m54.0s), 0000/0200 VUs, 42879 complete and 0 interrupted iterations
spike   [  67% ] 0000/0200 VUs  1m54.0s/2m50s  020.00 iters/s

running (1m55.0s), 0000/0200 VUs, 42899 complete and 0 interrupted iterations
spike   [  68% ] 0000/0200 VUs  1m55.0s/2m50s  020.00 iters/s

running (1m56.0s), 0000/0200 VUs, 42919 complete and 0 interrupted iterations
spike   [  68% ] 0000/0200 VUs  1m56.0s/2m50s  020.00 iters/s

running (1m57.0s), 0000/0200 VUs, 42939 complete and 0 interrupted iterations
spike   [  69% ] 0000/0200 VUs  1m57.0s/2m50s  020.00 iters/s

running (1m58.0s), 0000/0200 VUs, 42959 complete and 0 interrupted iterations
spike   [  69% ] 0000/0200 VUs  1m58.0s/2m50s  020.00 iters/s

running (1m59.0s), 0000/0200 VUs, 42979 complete and 0 interrupted iterations
spike   [  70% ] 0000/0200 VUs  1m59.0s/2m50s  020.00 iters/s

running (2m00.0s), 0000/0200 VUs, 42999 complete and 0 interrupted iterations
spike   [  71% ] 0000/0200 VUs  2m00.0s/2m50s  020.00 iters/s

running (2m01.0s), 0000/0200 VUs, 43019 complete and 0 interrupted iterations
spike   [  71% ] 0000/0200 VUs  2m01.0s/2m50s  020.00 iters/s

running (2m02.0s), 0000/0200 VUs, 43039 complete and 0 interrupted iterations
spike   [  72% ] 0000/0200 VUs  2m02.0s/2m50s  020.00 iters/s

running (2m03.0s), 0000/0200 VUs, 43059 complete and 0 interrupted iterations
spike   [  72% ] 0000/0200 VUs  2m03.0s/2m50s  020.00 iters/s

running (2m04.0s), 0000/0200 VUs, 43079 complete and 0 interrupted iterations
spike   [  73% ] 0000/0200 VUs  2m04.0s/2m50s  020.00 iters/s

running (2m05.0s), 0000/0200 VUs, 43099 complete and 0 interrupted iterations
spike   [  74% ] 0000/0200 VUs  2m05.0s/2m50s  020.00 iters/s

running (2m06.0s), 0000/0200 VUs, 43119 complete and 0 interrupted iterations
spike   [  74% ] 0000/0200 VUs  2m06.0s/2m50s  020.00 iters/s

running (2m07.0s), 0000/0200 VUs, 43139 complete and 0 interrupted iterations
spike   [  75% ] 0000/0200 VUs  2m07.0s/2m50s  020.00 iters/s

running (2m08.0s), 0000/0200 VUs, 43159 complete and 0 interrupted iterations
spike   [  75% ] 0000/0200 VUs  2m08.0s/2m50s  020.00 iters/s

running (2m09.0s), 0000/0200 VUs, 43179 complete and 0 interrupted iterations
spike   [  76% ] 0000/0200 VUs  2m09.0s/2m50s  020.00 iters/s

running (2m10.0s), 0000/0200 VUs, 43199 complete and 0 interrupted iterations
spike   [  76% ] 0000/0200 VUs  2m10.0s/2m50s  020.00 iters/s

running (2m11.0s), 0000/0200 VUs, 43219 complete and 0 interrupted iterations
spike   [  77% ] 0000/0200 VUs  2m11.0s/2m50s  020.00 iters/s

running (2m12.0s), 0000/0200 VUs, 43239 complete and 0 interrupted iterations
spike   [  78% ] 0000/0200 VUs  2m12.0s/2m50s  020.00 iters/s

running (2m13.0s), 0000/0200 VUs, 43259 complete and 0 interrupted iterations
spike   [  78% ] 0000/0200 VUs  2m13.0s/2m50s  020.00 iters/s

running (2m14.0s), 0000/0200 VUs, 43279 complete and 0 interrupted iterations
spike   [  79% ] 0000/0200 VUs  2m14.0s/2m50s  020.00 iters/s

running (2m15.0s), 0000/0200 VUs, 43299 complete and 0 interrupted iterations
spike   [  79% ] 0000/0200 VUs  2m15.0s/2m50s  020.00 iters/s

running (2m16.0s), 0000/0200 VUs, 43319 complete and 0 interrupted iterations
spike   [  80% ] 0000/0200 VUs  2m16.0s/2m50s  020.00 iters/s

running (2m17.0s), 0000/0200 VUs, 43339 complete and 0 interrupted iterations
spike   [  81% ] 0000/0200 VUs  2m17.0s/2m50s  020.00 iters/s

running (2m18.0s), 0000/0200 VUs, 43359 complete and 0 interrupted iterations
spike   [  81% ] 0000/0200 VUs  2m18.0s/2m50s  020.00 iters/s

running (2m19.0s), 0000/0200 VUs, 43379 complete and 0 interrupted iterations
spike   [  82% ] 0000/0200 VUs  2m19.0s/2m50s  020.00 iters/s

running (2m20.0s), 0000/0200 VUs, 43399 complete and 0 interrupted iterations
spike   [  82% ] 0000/0200 VUs  2m20.0s/2m50s  020.00 iters/s

running (2m21.0s), 0000/0200 VUs, 43419 complete and 0 interrupted iterations
spike   [  83% ] 0000/0200 VUs  2m21.0s/2m50s  020.00 iters/s

running (2m22.0s), 0000/0200 VUs, 43439 complete and 0 interrupted iterations
spike   [  84% ] 0000/0200 VUs  2m22.0s/2m50s  020.00 iters/s

running (2m23.0s), 0000/0200 VUs, 43459 complete and 0 interrupted iterations
spike   [  84% ] 0000/0200 VUs  2m23.0s/2m50s  020.00 iters/s

running (2m24.0s), 0000/0200 VUs, 43479 complete and 0 interrupted iterations
spike   [  85% ] 0000/0200 VUs  2m24.0s/2m50s  020.00 iters/s

running (2m25.0s), 0000/0200 VUs, 43499 complete and 0 interrupted iterations
spike   [  85% ] 0000/0200 VUs  2m25.0s/2m50s  020.00 iters/s

running (2m26.0s), 0000/0200 VUs, 43519 complete and 0 interrupted iterations
spike   [  86% ] 0000/0200 VUs  2m26.0s/2m50s  020.00 iters/s

running (2m27.0s), 0000/0200 VUs, 43539 complete and 0 interrupted iterations
spike   [  86% ] 0000/0200 VUs  2m27.0s/2m50s  020.00 iters/s

running (2m28.0s), 0000/0200 VUs, 43559 complete and 0 interrupted iterations
spike   [  87% ] 0000/0200 VUs  2m28.0s/2m50s  020.00 iters/s

running (2m29.0s), 0000/0200 VUs, 43579 complete and 0 interrupted iterations
spike   [  88% ] 0000/0200 VUs  2m29.0s/2m50s  020.00 iters/s

running (2m30.0s), 0000/0200 VUs, 43599 complete and 0 interrupted iterations
spike   [  88% ] 0000/0200 VUs  2m30.0s/2m50s  020.00 iters/s

running (2m31.0s), 0000/0200 VUs, 43619 complete and 0 interrupted iterations
spike   [  89% ] 0000/0200 VUs  2m31.0s/2m50s  020.00 iters/s

running (2m32.0s), 0000/0200 VUs, 43639 complete and 0 interrupted iterations
spike   [  89% ] 0000/0200 VUs  2m32.0s/2m50s  020.00 iters/s

running (2m33.0s), 0000/0200 VUs, 43659 complete and 0 interrupted iterations
spike   [  90% ] 0000/0200 VUs  2m33.0s/2m50s  020.00 iters/s

running (2m34.0s), 0000/0200 VUs, 43679 complete and 0 interrupted iterations
spike   [  91% ] 0000/0200 VUs  2m34.0s/2m50s  020.00 iters/s

running (2m35.0s), 0000/0200 VUs, 43699 complete and 0 interrupted iterations
spike   [  91% ] 0000/0200 VUs  2m35.0s/2m50s  020.00 iters/s

running (2m36.0s), 0000/0200 VUs, 43719 complete and 0 interrupted iterations
spike   [  92% ] 0000/0200 VUs  2m36.0s/2m50s  020.00 iters/s

running (2m37.0s), 0000/0200 VUs, 43739 complete and 0 interrupted iterations
spike   [  92% ] 0000/0200 VUs  2m37.0s/2m50s  020.00 iters/s

running (2m38.0s), 0000/0200 VUs, 43759 complete and 0 interrupted iterations
spike   [  93% ] 0000/0200 VUs  2m38.0s/2m50s  020.00 iters/s

running (2m39.0s), 0000/0200 VUs, 43779 complete and 0 interrupted iterations
spike   [  94% ] 0000/0200 VUs  2m39.0s/2m50s  020.00 iters/s

running (2m40.0s), 0000/0200 VUs, 43799 complete and 0 interrupted iterations
spike   [  94% ] 0000/0200 VUs  2m40.0s/2m50s  020.00 iters/s

running (2m41.0s), 0000/0200 VUs, 43819 complete and 0 interrupted iterations
spike   [  95% ] 0000/0200 VUs  2m41.0s/2m50s  020.00 iters/s

running (2m42.0s), 0000/0200 VUs, 43839 complete and 0 interrupted iterations
spike   [  95% ] 0000/0200 VUs  2m42.0s/2m50s  020.00 iters/s

running (2m43.0s), 0000/0200 VUs, 43859 complete and 0 interrupted iterations
spike   [  96% ] 0000/0200 VUs  2m43.0s/2m50s  020.00 iters/s

running (2m44.0s), 0000/0200 VUs, 43879 complete and 0 interrupted iterations
spike   [  96% ] 0000/0200 VUs  2m44.0s/2m50s  020.00 iters/s

running (2m45.0s), 0000/0200 VUs, 43899 complete and 0 interrupted iterations
spike   [  97% ] 0000/0200 VUs  2m45.0s/2m50s  020.00 iters/s

running (2m46.0s), 0000/0200 VUs, 43919 complete and 0 interrupted iterations
spike   [  98% ] 0000/0200 VUs  2m46.0s/2m50s  020.00 iters/s

running (2m47.0s), 0000/0200 VUs, 43939 complete and 0 interrupted iterations
spike   [  98% ] 0000/0200 VUs  2m47.0s/2m50s  020.00 iters/s

running (2m48.0s), 0000/0200 VUs, 43959 complete and 0 interrupted iterations
spike   [  99% ] 0000/0200 VUs  2m48.0s/2m50s  020.00 iters/s

running (2m49.0s), 0000/0200 VUs, 43979 complete and 0 interrupted iterations
spike   [  99% ] 0000/0200 VUs  2m49.0s/2m50s  020.00 iters/s

running (2m50.0s), 0000/0200 VUs, 43999 complete and 0 interrupted iterations
spike   [ 100% ] 0000/0200 VUs  2m50.0s/2m50s  020.00 iters/s


  █ THRESHOLDS 

    server_errors
    ✓ 'rate<0.005' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 43999   258.826173/s
    checks_succeeded...: 100.00% 43999 out of 43999
    checks_failed......: 0.00%   0 out of 43999

    ✓ not a server error

    CUSTOM
    rate_limited...................: 0.00%  0 out of 43999
    server_errors..................: 0.00%  0 out of 43999

    HTTP
    http_req_duration..............: avg=553.65µs min=91.58µs  med=492.83µs max=8.09ms  p(90)=705.8µs  p(95)=962.97µs
      { expected_response:true }...: avg=553.65µs min=91.58µs  med=492.83µs max=8.09ms  p(90)=705.8µs  p(95)=962.97µs
    http_req_failed................: 0.00%  0 out of 43999
    http_reqs......................: 43999  258.826173/s

    EXECUTION
    iteration_duration.............: avg=659.4µs  min=457.33µs med=586.7µs  max=27.46ms p(90)=838.12µs p(95)=1.19ms  
    iterations.....................: 43999  258.826173/s
    vus............................: 0      min=0          max=2  
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 546 MB 3.2 MB/s
    data_sent......................: 4.2 MB 25 kB/s



running (2m50.0s), 0000/0200 VUs, 43999 complete and 0 interrupted iterations
spike ✓ [ 100% ] 0000/0200 VUs  2m50s  020.00 iters/s
exit=0